ATsupportum/src/Documents/ВыполнениеЗаявкиНаАрендуПП_ат/ВыполнениеЗаявкиНаАрендуПП_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеЗаявкиНаАрендуПП_ат</name>
  <basedOn>Document.ЗаявкаНаАрендуПП_ат</basedOn>
  <registerRecords>AccumulationRegister.АрендаПП_ат</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуПП_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ДействиеПоЗаявкеНаАрендуПП_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Тикет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Поставки</name>
    <attributes>
      <name>ПродуктДляАренды</name>
      <type>
        <types>CatalogRef.ПродуктыДляАренды_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставка</name>
      <type>
        <types>CatalogRef.ПоставкиПродуктов_ат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ATsupportum/src/AccumulationRegisters/АрендаПП_ат/АрендаПП_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АрендаПП_ат</name>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПоставкаПродукта</name>
    <type>
      <types>CatalogRef.ПоставкиПродуктов_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПродуктДляАренды</name>
    <type>
      <types>CatalogRef.ПродуктыДляАренды_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ATsupportum/src/InformationRegisters/СтатусыЗаявокНаАренду_ат/СтатусыЗаявокНаАренду_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявокНаАренду_ат</name>
  <comment>!!!!!HOTFIX + переименовать</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТипыСтатусовЗаявокНаАренду_ат</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуОборудования_ат</types>
      <types>DocumentRef.ЗаявкаНаАрендуПП_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/Enums/ДействиеПоЗаявкеНаАрендуПП_ат/ДействиеПоЗаявкеНаАрендуПП_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействиеПоЗаявкеНаАрендуПП_ат</name>
  <enumValues>
    <name>ЗаказПП</name>
  </enumValues>
  <enumValues>
    <name>ОтказПП</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Enums/ТипыСтатусовЗаявокНаАренду_ат/ТипыСтатусовЗаявокНаАренду_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтатусовЗаявокНаАренду_ат</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ИсполненаСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>НаТехническомСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаФинансовомСогласовании</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Catalogs/Договоры_ат/Договоры_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры_ат</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты_ат</owners>
  <attributes>
    <name>Автопролонгация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.ВидыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатыПоДоговорам_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасторжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПостоплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитСуммыПриПостоплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВнутреннее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноВнешнееСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуОборудования_ат</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>CatalogRef.Проекты_ат</types>
      <types>DocumentRef.ЗаявкаНаАрендуПП_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДанныхДляОпределенияТарифногоПлана</name>
    <type>
      <types>EnumRef.ПериодДанныхДляОпределенияТарифногоПлана_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРеализаций</name>
    <type>
      <types>EnumRef.ПериодичностиРеализаций_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСчетов</name>
    <type>
      <types>EnumRef.ПериодичностиСчетов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасторжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодДоговора</name>
    <type>
      <types>EnumRef.РодыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодписанияРеализации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаТарифногоПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/Documents/ВыполнениеЗаявкиНаАрендуПП_ат/ObjectModule.bsl
//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаАрендуПП_ат") Тогда
	//	// Заполнение шапки
	//	Действие = ДанныеЗаполнения.Действие;
	//	Клиент = ДанныеЗаполнения.Клиент;
	//	ДокументОснование = ДанныеЗаполнения.Ссылка;
	//	Для Каждого ТекСтрокаАрендуемыеПП Из ДанныеЗаполнения.АрендуемыеПП Цикл
	//		НоваяСтрока = Поставки.Добавить();
	//		НоваяСтрока.Количество = ТекСтрокаАрендуемыеПП.Количество;
	//		НоваяСтрока.ПродуктДляАренды = ТекСтрокаАрендуемыеПП.ПоставкаПП;
	//	КонецЦикла;
	//КонецЕсли;
	////}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//КонецПроцедуры

	Процедура ОбработкаПроведения(Отказ, Режим)
		Если Действие = Перечисления.ДействиеПоЗаявкеНаАрендуПП_ат.ЗаказПП тогда
			
			Движения.АрендаПП_ат.Записывать = Истина;
			Для Каждого ТекСтрокаПоставки Из Поставки Цикл
				Движение = Движения.АрендаПП_ат.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ПоставкаПродукта = ТекСтрокаПоставки.Поставка;
				Движение.Клиент = ДокументОснование.Ссылка.Клиент;
				Движение.ПродуктДляАренды = ТекСтрокаПоставки.ПродуктДляАренды;
				Движение.Организация = Организация;
				Движение.Договор = Договор;
				Движение.Ресурс = ТекСтрокаПоставки.Количество;
			КонецЦикла;
			
		// создаем допик договора:
				
		//Если УчетУслуг_ат.ФормированиеДопДоговора(Договор,ДокументОснование) = истина тогда
			//иначе отказ = Истина;
		//КонецЕсли;
		
	
			
		ИначеЕсли Действие = Перечисления.ДействиеПоЗаявкеНаАрендуПП_ат.ОтказПП тогда
			
			Движения.АрендаПП_ат.Записывать = Истина;
			Для Каждого ТекСтрокаПоставки Из Поставки Цикл
				Движение = Движения.АрендаПП_ат.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.ПоставкаПродукта = ТекСтрокаПоставки.Поставка;
				Движение.Клиент = ДокументОснование.Ссылка.Клиент;
				Движение.Организация = Организация;
				Движение.Договор = Договор;
				Движение.ПродуктДляАренды = ТекСтрокаПоставки.ПродуктДляАренды;
				Движение.Ресурс = ТекСтрокаПоставки.Количество;
			КонецЦикла;
		КонецЕсли;
	
	КонецПроцедуры
	
	&НаСервере
	Процедура ПриЗаписи(Отказ)

	ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
	ЗаписьСтатуса.Отбор.Заявка.Установить(ЭтотОбъект.ДокументОснование);
	
	НаборСведений = ЗаписьСтатуса.Добавить();
	НаборСведений.Заявка = ЭтотОбъект.ДокументОснование;
	НаборСведений.Период = ТекущаяДата();
	
	Если ЭтотОбъект.Проведен = ложь и ЭтотОбъект.ПометкаУдаления = ложь тогда
		НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.ВОбработке;
	ИначеЕсли ЭтотОбъект.ПометкаУдаления = Истина тогда
		НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.Отклонена;
	ИначеЕсли ЭтотОбъект.Проведен = Истина тогда 
		НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.ОжиданиеОплаты;
	КонецЕсли;
	
	НаборСведений.Пользователь = Пользователи.ТекущийПользователь();
	НаборСведений.Регистратор = ЭтотОбъект;
	ЗаписьСтатуса.Записать(Истина);

		
	КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если РежимЗаписи = РежимЗаписиДокумента.Запись тогда		
		//если документ записан 	
		ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
		ЗаписьСтатуса.Отбор.Заявка.Установить(ЭтотОбъект.ДокументОснование);
		НаборСведений = ЗаписьСтатуса.Добавить();
		НаборСведений.Заявка = ЭтотОбъект.ДокументОснование;
		НаборСведений.Период = ТекущаяДата();
		НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении;
		НаборСведений.Пользователь = Пользователи.ТекущийПользователь();
		НаборСведений.Регистратор = ЭтотОбъект;
		ЗаписьСтатуса.Записать(Истина);
		
	Иначеесли РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
		ЗаписьСтатуса.Отбор.Заявка.Установить(ЭтотОбъект.ДокументОснование);
		НаборСведений = ЗаписьСтатуса.Добавить();
		НаборСведений.Заявка = ЭтотОбъект.ДокументОснование;
		НаборСведений.Период = ТекущаяДата();
		НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.ОжиданиеОплаты;
		НаборСведений.Пользователь = Пользователи.ТекущийПользователь();
		НаборСведений.Регистратор = ЭтотОбъект;
		ЗаписьСтатуса.Записать(Истина);
		
		
	Иначеесли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда
		ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
		ЗаписьСтатуса.Отбор.Заявка.Установить(ЭтотОбъект.ДокументОснование);
		НаборСведений = ЗаписьСтатуса.Добавить();
		НаборСведений.Заявка = ЭтотОбъект.ДокументОснование;
		НаборСведений.Период = ТекущаяДата();
		НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.Отклонена;
		НаборСведений.Пользователь = Пользователи.ТекущийПользователь();
		НаборСведений.Регистратор = ЭтотОбъект;
		ЗаписьСтатуса.Записать(Истина);
	КонецЕсли
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ПометкаУдаления = ложь;
	Основание = ДокументОснование;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры_ат.Ссылка
		|ИЗ
		|	Справочник.Договоры_ат КАК Договоры_ат
		|ГДЕ
		|	Договоры_ат.ПометкаУдаления = &ПометкаУдаления
		|	И Договоры_ат.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дог = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		дог.ПометкаУдаления = Истина;
		Дог.Записать();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;      // только это почему-то не работает...
	
	ДокументВыполнениеЗаявки = Аренда_ат.ПолучаемАктивныйДокументВыполненияЗаявки(ДанныеЗаполнения);
	Если  ДокументВыполнениеЗаявки = Неопределено тогда

	Аренда_ат.СоздатьВыполнениеЗаявки(ДанныеЗаполнения, ЭтотОбъект);	

		
	Иначе
		сообщение = "У данной завки уже есть документ-выполнение!  => "+ Символы.ПС  +ДокументВыполнениеЗаявки + Символы.ПС + 
		"Новый документ создан не будет!";
		ВызватьИсключение сообщение;
	КонецЕсли;	
КонецПроцедуры



//		Действие 			= ДанныеЗаполнения.Действие;
//		Клиент 				= ДанныеЗаполнения.Клиент;
//		ДокументОснование 	= ДанныеЗаполнения.Ссылка;
//		Тикет 				= ДанныеЗаполнения.Тикет;
//		Для Каждого ТекСтрокаАрендуемыеПП Из ДанныеЗаполнения.АрендуемыеПП Цикл
//			НоваяСтрока = Поставки.Добавить();
//			НоваяСтрока.Количество = ТекСтрокаАрендуемыеПП.Количество;
//			НоваяСтрока.ПродуктДляАренды = ТекСтрокаАрендуемыеПП.ПоставкаПП;
//		КонецЦикла;
//		Дата 				= ТекущаяДата();
//		



//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
//	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаАрендуПП_ат") Тогда
//		// Заполнение шапки
//		Действие = ДанныеЗаполнения.Действие;
//		Клиент = ДанныеЗаполнения.Клиент;
//		ДокументОснование = ДанныеЗаполнения.Ссылка;
//		Тикет = ДанныеЗаполнения.Тикет;
//		Для Каждого ТекСтрокаАрендуемыеПП Из ДанныеЗаполнения.АрендуемыеПП Цикл
//			НоваяСтрока = Поставки.Добавить();
//			НоваяСтрока.Количество = ТекСтрокаАрендуемыеПП.Количество;
//			НоваяСтрока.ПродуктДляАренды = ТекСтрокаАрендуемыеПП.ПоставкаПП;
//		КонецЦикла;
//	КонецЕсли;

//КонецПроцедуры
